### DataFrame_Pandas

In [44]:
#Boolean
print(True == False)
print(True != 0)
print(False == 0)
print(True or False)
print(1 == '1')
print(1==1)

False
True
True
True
False
True

In [45]:
#문자열
eng = 'Korea COVID 19'
print(eng.lower())
print(eng.upper())
kr = 'korea'
print(kr.upper())

korea covid 19
KOREA COVID 19
KOREA

In [53]:
#Lists []
data = []
data.append('java')
print(data[0])
print(data[-1])
print(data[1:])
print(data[:2])
data.sort()
print(data)
data.reverse()
print(data)

java
java
[]
['java']
['java']
['java']

In [52]:
dt = []
dt.append('dt')
dt

['dt']

In [26]:
#Tuple
b=(1,2,3,'사','오')
c=1,2,3
type(b),type(c)

(tuple, tuple)

In [27]:
b[3]=4 #튜플의 요소는 기본적으로는 바꿀수 없다

TypeError: 'tuple' object does not support item assignment

In [29]:
print(b[3:])
print(b[1:4])

('사', '오')
(2, 3, '사')

In [54]:
a=(1,2,3)
print(type(a))
a[0]=5

<class 'tuple'>

TypeError: 'tuple' object does not support item assignment

In [42]:
#Dictionay
dic = {'name1':'경민','학번1':20103,'name2':'경민2','학번2':20104}
print(dic.get('name1'))
print(dic.keys())
dic.values()

경민
dict_keys(['name1', '학번1', 'name2', '학번2'])

dict_values(['경민', 20103, '경민2', 20104])

In [43]:
#set
lunch = {'햄버거','치킨','라면','콜라',10000}
dinner = {'피자','족발','라면','콜라',10000}
print(lunch & dinner)
print(dinner | lunch)

{10000, '라면', '콜라'}
{'피자', '치킨', '라면', '족발', '햄버거', 10000, '콜라'}

In [55]:
import pandas as pd

In [56]:
#프레임으로 출력해보기
s1=pd.core.series.Series([1,2,3])
s2=pd.core.series.Series(['일','이','삼'])
pd.DataFrame(data=dict(num=s1,word=s2))

   num word
0    1    일
1    2    이
2    3    삼

In [62]:
num_se=pd.Series([1,2,3,4,5])
num_df=pd.DataFrame([1,2,3,4,5],index=[1,2,3,4,5])
num_df

   0
1  1
2  2
3  3
4  4
5  5

In [63]:
#Dict 를 이용한 DaatFrame 생성
man = [
    {'name':'은주','age':20,'job':'j1'},
    {'name':'민서','age':30,'job':'j2'},
    {'name':'경민','age':15,'job':'j1'}
]
df=pd.DataFrame(man,index=[1,2,3])
df

  name  age job
1   은주   20  j1
2   민서   30  j2
3   경민   15  j1

In [64]:
#리스트의 프레임 
person = [
    ['a',100,80],['b',17,60],['c',50,40],['d',90,80]
]
col_name=['name','국어','영어']
df=pd.DataFrame.from_records(person,columns=col_name,index=[1,2,3,4])
df[['국어','영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [90]:
meal = {
    '3식':['아침','점심','저녘'],
    '메뉴':['삽겹살','치킨','피자']
    }
me_df=pd.DataFrame(meal,index=[1,2,3])
me_df

   3식   메뉴
1  아침  삽겹살
2  점심   치킨
3  저녘   피자

In [88]:
score = {
    '학번':[30102,30201,30303,30501],
    'java':[90,100,80,70],
    'Python':[30,100,100,100],
    'C':[50,90,70,100],
    '합계':['','','','']
    }
sc_df=pd.DataFrame(score,index=['','','',''])
sc_df

     학번  java  Python    C 합계
  30102    90      30   50
  30201   100     100   90
  30303    80     100   70
  30501    70     100  100